espressif/esp-idf/components/soc/esp32c61/register/soc/hp_apm_reg.h
/** HP_APM_REGION8_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION8_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x64)
/** HP_APM_REGION8_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 8.
 */
#define HP_APM_REGION8_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION8_ADDR_START_M  (HP_APM_REGION8_ADDR_START_V << HP_APM_REGION8_ADDR_START_S)
#define HP_APM_REGION8_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION8_ADDR_START_S  0

/** HP_APM_REGION8_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION8_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x68)
/** HP_APM_REGION8_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 8.
 */
#define HP_APM_REGION8_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION8_ADDR_END_M  (HP_APM_REGION8_ADDR_END_V << HP_APM_REGION8_ADDR_END_S)
#define HP_APM_REGION8_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION8_ADDR_END_S  0

/** HP_APM_REGION8_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION8_ATTR_REG (DR_REG_HP_APM_BASE + 0x6c)
/** HP_APM_REGION8_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 8.
 */
#define HP_APM_REGION8_R0_X    (BIT(0))
#define HP_APM_REGION8_R0_X_M  (HP_APM_REGION8_R0_X_V << HP_APM_REGION8_R0_X_S)
#define HP_APM_REGION8_R0_X_V  0x00000001U
#define HP_APM_REGION8_R0_X_S  0
/** HP_APM_REGION8_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 8.
 */
#define HP_APM_REGION8_R0_W    (BIT(1))
#define HP_APM_REGION8_R0_W_M  (HP_APM_REGION8_R0_W_V << HP_APM_REGION8_R0_W_S)
#define HP_APM_REGION8_R0_W_V  0x00000001U
#define HP_APM_REGION8_R0_W_S  1
/** HP_APM_REGION8_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 8.
 */
#define HP_APM_REGION8_R0_R    (BIT(2))
#define HP_APM_REGION8_R0_R_M  (HP_APM_REGION8_R0_R_V << HP_APM_REGION8_R0_R_S)
#define HP_APM_REGION8_R0_R_V  0x00000001U
#define HP_APM_REGION8_R0_R_S  2
/** HP_APM_REGION8_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 8.
 */
#define HP_APM_REGION8_R1_X    (BIT(4))
#define HP_APM_REGION8_R1_X_M  (HP_APM_REGION8_R1_X_V << HP_APM_REGION8_R1_X_S)
#define HP_APM_REGION8_R1_X_V  0x00000001U
#define HP_APM_REGION8_R1_X_S  4
/** HP_APM_REGION8_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 8.
 */
#define HP_APM_REGION8_R1_W    (BIT(5))
#define HP_APM_REGION8_R1_W_M  (HP_APM_REGION8_R1_W_V << HP_APM_REGION8_R1_W_S)
#define HP_APM_REGION8_R1_W_V  0x00000001U
#define HP_APM_REGION8_R1_W_S  5
/** HP_APM_REGION8_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 8.
 */
#define HP_APM_REGION8_R1_R    (BIT(6))
#define HP_APM_REGION8_R1_R_M  (HP_APM_REGION8_R1_R_V << HP_APM_REGION8_R1_R_S)
#define HP_APM_REGION8_R1_R_V  0x00000001U
#define HP_APM_REGION8_R1_R_S  6
/** HP_APM_REGION8_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 8.
 */
#define HP_APM_REGION8_R2_X    (BIT(8))
#define HP_APM_REGION8_R2_X_M  (HP_APM_REGION8_R2_X_V << HP_APM_REGION8_R2_X_S)
#define HP_APM_REGION8_R2_X_V  0x00000001U
#define HP_APM_REGION8_R2_X_S  8
/** HP_APM_REGION8_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 8.
 */
#define HP_APM_REGION8_R2_W    (BIT(9))
#define HP_APM_REGION8_R2_W_M  (HP_APM_REGION8_R2_W_V << HP_APM_REGION8_R2_W_S)
#define HP_APM_REGION8_R2_W_V  0x00000001U
#define HP_APM_REGION8_R2_W_S  9
/** HP_APM_REGION8_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 8.
 */
#define HP_APM_REGION8_R2_R    (BIT(10))
#define HP_APM_REGION8_R2_R_M  (HP_APM_REGION8_R2_R_V << HP_APM_REGION8_R2_R_S)
#define HP_APM_REGION8_R2_R_V  0x00000001U
#define HP_APM_REGION8_R2_R_S  10
/** HP_APM_REGION8_LOCK : R/W; bitpos: [11]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_APM_REGION8_LOCK    (BIT(11))
#define HP_APM_REGION8_LOCK_M  (HP_APM_REGION8_LOCK_V << HP_APM_REGION8_LOCK_S)
#define HP_APM_REGION8_LOCK_V  0x00000001U
#define HP_APM_REGION8_LOCK_S  11

/** HP_APM_REGION9_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION9_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x70)
/** HP_APM_REGION9_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 9.
 */
#define HP_APM_REGION9_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION9_ADDR_START_M  (HP_APM_REGION9_ADDR_START_V << HP_APM_REGION9_ADDR_START_S)
#define HP_APM_REGION9_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION9_ADDR_START_S  0

/** HP_APM_REGION9_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION9_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x74)
/** HP_APM_REGION9_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 9.
 */
#define HP_APM_REGION9_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION9_ADDR_END_M  (HP_APM_REGION9_ADDR_END_V << HP_APM_REGION9_ADDR_END_S)
#define HP_APM_REGION9_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION9_ADDR_END_S  0

/** HP_APM_REGION9_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION9_ATTR_REG (DR_REG_HP_APM_BASE + 0x78)
/** HP_APM_REGION9_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 9.
 */
#define HP_APM_REGION9_R0_X    (BIT(0))
#define HP_APM_REGION9_R0_X_M  (HP_APM_REGION9_R0_X_V << HP_APM_REGION9_R0_X_S)
#define HP_APM_REGION9_R0_X_V  0x00000001U
#define HP_APM_REGION9_R0_X_S  0
/** HP_APM_REGION9_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 9.
 */
#define HP_APM_REGION9_R0_W    (BIT(1))
#define HP_APM_REGION9_R0_W_M  (HP_APM_REGION9_R0_W_V << HP_APM_REGION9_R0_W_S)
#define HP_APM_REGION9_R0_W_V  0x00000001U
#define HP_APM_REGION9_R0_W_S  1
/** HP_APM_REGION9_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 9.
 */
#define HP_APM_REGION9_R0_R    (BIT(2))
#define HP_APM_REGION9_R0_R_M  (HP_APM_REGION9_R0_R_V << HP_APM_REGION9_R0_R_S)
#define HP_APM_REGION9_R0_R_V  0x00000001U
#define HP_APM_REGION9_R0_R_S  2
/** HP_APM_REGION9_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 9.
 */
#define HP_APM_REGION9_R1_X    (BIT(4))
#define HP_APM_REGION9_R1_X_M  (HP_APM_REGION9_R1_X_V << HP_APM_REGION9_R1_X_S)
#define HP_APM_REGION9_R1_X_V  0x00000001U
#define HP_APM_REGION9_R1_X_S  4
/** HP_APM_REGION9_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 9.
 */
#define HP_APM_REGION9_R1_W    (BIT(5))
#define HP_APM_REGION9_R1_W_M  (HP_APM_REGION9_R1_W_V << HP_APM_REGION9_R1_W_S)
#define HP_APM_REGION9_R1_W_V  0x00000001U
#define HP_APM_REGION9_R1_W_S  5
/** HP_APM_REGION9_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 9.
 */
#define HP_APM_REGION9_R1_R    (BIT(6))
#define HP_APM_REGION9_R1_R_M  (HP_APM_REGION9_R1_R_V << HP_APM_REGION9_R1_R_S)
#define HP_APM_REGION9_R1_R_V  0x00000001U
#define HP_APM_REGION9_R1_R_S  6
/** HP_APM_REGION9_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 9.
 */
#define HP_APM_REGION9_R2_X    (BIT(8))
#define HP_APM_REGION9_R2_X_M  (HP_APM_REGION9_R2_X_V << HP_APM_REGION9_R2_X_S)
#define HP_APM_REGION9_R2_X_V  0x00000001U
#define HP_APM_REGION9_R2_X_S  8
/** HP_APM_REGION9_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 9.
 */
#define HP_APM_REGION9_R2_W    (BIT(9))
#define HP_APM_REGION9_R2_W_M  (HP_APM_REGION9_R2_W_V << HP_APM_REGION9_R2_W_S)
#define HP_APM_REGION9_R2_W_V  0x00000001U
#define HP_APM_REGION9_R2_W_S  9
/** HP_APM_REGION9_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 9.
 */
#define HP_APM_REGION9_R2_R    (BIT(10))
#define HP_APM_REGION9_R2_R_M  (HP_APM_REGION9_R2_R_V << HP_APM_REGION9_R2_R_S)
#define HP_APM_REGION9_R2_R_V  0x00000001U
#define HP_APM_REGION9_R2_R_S  10
/** HP_APM_REGION9_LOCK : R/W; bitpos: [11]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_APM_REGION9_LOCK    (BIT(11))
#define HP_APM_REGION9_LOCK_M  (HP_APM_REGION9_LOCK_V << HP_APM_REGION9_LOCK_S)
#define HP_APM_REGION9_LOCK_V  0x00000001U
#define HP_APM_REGION9_LOCK_S  11

/** HP_APM_REGION10_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION10_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x7c)
/** HP_APM_REGION10_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 10.
 */
#define HP_APM_REGION10_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION10_ADDR_START_M  (HP_APM_REGION10_ADDR_START_V << HP_APM_REGION10_ADDR_START_S)
#define HP_APM_REGION10_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION10_ADDR_START_S  0

/** HP_APM_REGION10_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION10_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x80)
/** HP_APM_REGION10_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 10.
 */
#define HP_APM_REGION10_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION10_ADDR_END_M  (HP_APM_REGION10_ADDR_END_V << HP_APM_REGION10_ADDR_END_S)
#define HP_APM_REGION10_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION10_ADDR_END_S  0

/** HP_APM_REGION10_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION10_ATTR_REG (DR_REG_HP_APM_BASE + 0x84)
/** HP_APM_REGION10_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 10.
 */
#define HP_APM_REGION10_R0_X    (BIT(0))
#define HP_APM_REGION10_R0_X_M  (HP_APM_REGION10_R0_X_V << HP_APM_REGION10_R0_X_S)
#define HP_APM_REGION10_R0_X_V  0x00000001U
#define HP_APM_REGION10_R0_X_S  0
/** HP_APM_REGION10_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 10.
 */
#define HP_APM_REGION10_R0_W    (BIT(1))
#define HP_APM_REGION10_R0_W_M  (HP_APM_REGION10_R0_W_V << HP_APM_REGION10_R0_W_S)
#define HP_APM_REGION10_R0_W_V  0x00000001U
#define HP_APM_REGION10_R0_W_S  1
/** HP_APM_REGION10_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 10.
 */
#define HP_APM_REGION10_R0_R    (BIT(2))
#define HP_APM_REGION10_R0_R_M  (HP_APM_REGION10_R0_R_V << HP_APM_REGION10_R0_R_S)
#define HP_APM_REGION10_R0_R_V  0x00000001U
#define HP_APM_REGION10_R0_R_S  2
/** HP_APM_REGION10_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 10.
 */
#define HP_APM_REGION10_R1_X    (BIT(4))
#define HP_APM_REGION10_R1_X_M  (HP_APM_REGION10_R1_X_V << HP_APM_REGION10_R1_X_S)
#define HP_APM_REGION10_R1_X_V  0x00000001U
#define HP_APM_REGION10_R1_X_S  4
/** HP_APM_REGION10_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 10.
 */
#define HP_APM_REGION10_R1_W    (BIT(5))
#define HP_APM_REGION10_R1_W_M  (HP_APM_REGION10_R1_W_V << HP_APM_REGION10_R1_W_S)
#define HP_APM_REGION10_R1_W_V  0x00000001U
#define HP_APM_REGION10_R1_W_S  5
/** HP_APM_REGION10_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 10.
 */
#define HP_APM_REGION10_R1_R    (BIT(6))
#define HP_APM_REGION10_R1_R_M  (HP_APM_REGION10_R1_R_V << HP_APM_REGION10_R1_R_S)
#define HP_APM_REGION10_R1_R_V  0x00000001U
#define HP_APM_REGION10_R1_R_S  6
/** HP_APM_REGION10_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 10.
 */
#define HP_APM_REGION10_R2_X    (BIT(8))
#define HP_APM_REGION10_R2_X_M  (HP_APM_REGION10_R2_X_V << HP_APM_REGION10_R2_X_S)
#define HP_APM_REGION10_R2_X_V  0x00000001U
#define HP_APM_REGION10_R2_X_S  8
/** HP_APM_REGION10_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 10.
 */
#define HP_APM_REGION10_R2_W    (BIT(9))
#define HP_APM_REGION10_R2_W_M  (HP_APM_REGION10_R2_W_V << HP_APM_REGION10_R2_W_S)
#define HP_APM_REGION10_R2_W_V  0x00000001U
#define HP_APM_REGION10_R2_W_S  9
/** HP_APM_REGION10_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 10.
 */
#define HP_APM_REGION10_R2_R    (BIT(10))
#define HP_APM_REGION10_R2_R_M  (HP_APM_REGION10_R2_R_V << HP_APM_REGION10_R2_R_S)
#define HP_APM_REGION10_R2_R_V  0x00000001U
#define HP_APM_REGION10_R2_R_S  10
/** HP_APM_REGION10_LOCK : R/W; bitpos: [11]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_APM_REGION10_LOCK    (BIT(11))
#define HP_APM_REGION10_LOCK_M  (HP_APM_REGION10_LOCK_V << HP_APM_REGION10_LOCK_S)
#define HP_APM_REGION10_LOCK_V  0x00000001U
#define HP_APM_REGION10_LOCK_S  11

/** HP_APM_REGION11_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION11_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x88)
/** HP_APM_REGION11_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 11.
 */
#define HP_APM_REGION11_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION11_ADDR_START_M  (HP_APM_REGION11_ADDR_START_V << HP_APM_REGION11_ADDR_START_S)
#define HP_APM_REGION11_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION11_ADDR_START_S  0

/** HP_APM_REGION11_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION11_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x8c)
/** HP_APM_REGION11_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 11.
 */
#define HP_APM_REGION11_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION11_ADDR_END_M  (HP_APM_REGION11_ADDR_END_V << HP_APM_REGION11_ADDR_END_S)
#define HP_APM_REGION11_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION11_ADDR_END_S  0

/** HP_APM_REGION11_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION11_ATTR_REG (DR_REG_HP_APM_BASE + 0x90)
/** HP_APM_REGION11_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 11.
 */
#define HP_APM_REGION11_R0_X    (BIT(0))
#define HP_APM_REGION11_R0_X_M  (HP_APM_REGION11_R0_X_V << HP_APM_REGION11_R0_X_S)
#define HP_APM_REGION11_R0_X_V  0x00000001U
#define HP_APM_REGION11_R0_X_S  0
/** HP_APM_REGION11_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 11.
 */
#define HP_APM_REGION11_R0_W    (BIT(1))
#define HP_APM_REGION11_R0_W_M  (HP_APM_REGION11_R0_W_V << HP_APM_REGION11_R0_W_S)
#define HP_APM_REGION11_R0_W_V  0x00000001U
#define HP_APM_REGION11_R0_W_S  1
/** HP_APM_REGION11_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 11.
 */
#define HP_APM_REGION11_R0_R    (BIT(2))
#define HP_APM_REGION11_R0_R_M  (HP_APM_REGION11_R0_R_V << HP_APM_REGION11_R0_R_S)
#define HP_APM_REGION11_R0_R_V  0x00000001U
#define HP_APM_REGION11_R0_R_S  2
/** HP_APM_REGION11_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 11.
 */
#define HP_APM_REGION11_R1_X    (BIT(4))
#define HP_APM_REGION11_R1_X_M  (HP_APM_REGION11_R1_X_V << HP_APM_REGION11_R1_X_S)
#define HP_APM_REGION11_R1_X_V  0x00000001U
#define HP_APM_REGION11_R1_X_S  4
/** HP_APM_REGION11_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 11.
 */
#define HP_APM_REGION11_R1_W    (BIT(5))
#define HP_APM_REGION11_R1_W_M  (HP_APM_REGION11_R1_W_V << HP_APM_REGION11_R1_W_S)
#define HP_APM_REGION11_R1_W_V  0x00000001U
#define HP_APM_REGION11_R1_W_S  5
/** HP_APM_REGION11_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 11.
 */
#define HP_APM_REGION11_R1_R    (BIT(6))
#define HP_APM_REGION11_R1_R_M  (HP_APM_REGION11_R1_R_V << HP_APM_REGION11_R1_R_S)
#define HP_APM_REGION11_R1_R_V  0x00000001U
#define HP_APM_REGION11_R1_R_S  6
/** HP_APM_REGION11_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 11.
 */
#define HP_APM_REGION11_R2_X    (BIT(8))
#define HP_APM_REGION11_R2_X_M  (HP_APM_REGION11_R2_X_V << HP_APM_REGION11_R2_X_S)
#define HP_APM_REGION11_R2_X_V  0x00000001U
#define HP_APM_REGION11_R2_X_S  8
/** HP_APM_REGION11_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 11.
 */
#define HP_APM_REGION11_R2_W    (BIT(9))
#define HP_APM_REGION11_R2_W_M  (HP_APM_REGION11_R2_W_V << HP_APM_REGION11_R2_W_S)
#define HP_APM_REGION11_R2_W_V  0x00000001U
#define HP_APM_REGION11_R2_W_S  9
/** HP_APM_REGION11_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 11.
 */
#define HP_APM_REGION11_R2_R    (BIT(10))
#define HP_APM_REGION11_R2_R_M  (HP_APM_REGION11_R2_R_V << HP_APM_REGION11_R2_R_S)
#define HP_APM_REGION11_R2_R_V  0x00000001U
#define HP_APM_REGION11_R2_R_S  10
/** HP_APM_REGION11_LOCK : R/W; bitpos: [11]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_APM_REGION11_LOCK    (BIT(11))
#define HP_APM_REGION11_LOCK_M  (HP_APM_REGION11_LOCK_V << HP_APM_REGION11_LOCK_S)
#define HP_APM_REGION11_LOCK_V  0x00000001U
#define HP_APM_REGION11_LOCK_S  11

