espressif/esp-idf/components/soc/esp32c61/register/soc/hp_apm_reg.h
/** HP_APM_REGION12_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION12_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x94)
/** HP_APM_REGION12_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 12.
 */
#define HP_APM_REGION12_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION12_ADDR_START_M  (HP_APM_REGION12_ADDR_START_V << HP_APM_REGION12_ADDR_START_S)
#define HP_APM_REGION12_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION12_ADDR_START_S  0

/** HP_APM_REGION12_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION12_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x98)
/** HP_APM_REGION12_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 12.
 */
#define HP_APM_REGION12_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION12_ADDR_END_M  (HP_APM_REGION12_ADDR_END_V << HP_APM_REGION12_ADDR_END_S)
#define HP_APM_REGION12_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION12_ADDR_END_S  0

/** HP_APM_REGION12_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION12_ATTR_REG (DR_REG_HP_APM_BASE + 0x9c)
/** HP_APM_REGION12_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 12.
 */
#define HP_APM_REGION12_R0_X    (BIT(0))
#define HP_APM_REGION12_R0_X_M  (HP_APM_REGION12_R0_X_V << HP_APM_REGION12_R0_X_S)
#define HP_APM_REGION12_R0_X_V  0x00000001U
#define HP_APM_REGION12_R0_X_S  0
/** HP_APM_REGION12_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 12.
 */
#define HP_APM_REGION12_R0_W    (BIT(1))
#define HP_APM_REGION12_R0_W_M  (HP_APM_REGION12_R0_W_V << HP_APM_REGION12_R0_W_S)
#define HP_APM_REGION12_R0_W_V  0x00000001U
#define HP_APM_REGION12_R0_W_S  1
/** HP_APM_REGION12_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 12.
 */
#define HP_APM_REGION12_R0_R    (BIT(2))
#define HP_APM_REGION12_R0_R_M  (HP_APM_REGION12_R0_R_V << HP_APM_REGION12_R0_R_S)
#define HP_APM_REGION12_R0_R_V  0x00000001U
#define HP_APM_REGION12_R0_R_S  2
/** HP_APM_REGION12_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 12.
 */
#define HP_APM_REGION12_R1_X    (BIT(4))
#define HP_APM_REGION12_R1_X_M  (HP_APM_REGION12_R1_X_V << HP_APM_REGION12_R1_X_S)
#define HP_APM_REGION12_R1_X_V  0x00000001U
#define HP_APM_REGION12_R1_X_S  4
/** HP_APM_REGION12_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 12.
 */
#define HP_APM_REGION12_R1_W    (BIT(5))
#define HP_APM_REGION12_R1_W_M  (HP_APM_REGION12_R1_W_V << HP_APM_REGION12_R1_W_S)
#define HP_APM_REGION12_R1_W_V  0x00000001U
#define HP_APM_REGION12_R1_W_S  5
/** HP_APM_REGION12_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 12.
 */
#define HP_APM_REGION12_R1_R    (BIT(6))
#define HP_APM_REGION12_R1_R_M  (HP_APM_REGION12_R1_R_V << HP_APM_REGION12_R1_R_S)
#define HP_APM_REGION12_R1_R_V  0x00000001U
#define HP_APM_REGION12_R1_R_S  6
/** HP_APM_REGION12_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 12.
 */
#define HP_APM_REGION12_R2_X    (BIT(8))
#define HP_APM_REGION12_R2_X_M  (HP_APM_REGION12_R2_X_V << HP_APM_REGION12_R2_X_S)
#define HP_APM_REGION12_R2_X_V  0x00000001U
#define HP_APM_REGION12_R2_X_S  8
/** HP_APM_REGION12_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 12.
 */
#define HP_APM_REGION12_R2_W    (BIT(9))
#define HP_APM_REGION12_R2_W_M  (HP_APM_REGION12_R2_W_V << HP_APM_REGION12_R2_W_S)
#define HP_APM_REGION12_R2_W_V  0x00000001U
#define HP_APM_REGION12_R2_W_S  9
/** HP_APM_REGION12_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 12.
 */
#define HP_APM_REGION12_R2_R    (BIT(10))
#define HP_APM_REGION12_R2_R_M  (HP_APM_REGION12_R2_R_V << HP_APM_REGION12_R2_R_S)
#define HP_APM_REGION12_R2_R_V  0x00000001U
#define HP_APM_REGION12_R2_R_S  10
/** HP_APM_REGION12_LOCK : R/W; bitpos: [11]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_APM_REGION12_LOCK    (BIT(11))
#define HP_APM_REGION12_LOCK_M  (HP_APM_REGION12_LOCK_V << HP_APM_REGION12_LOCK_S)
#define HP_APM_REGION12_LOCK_V  0x00000001U
#define HP_APM_REGION12_LOCK_S  11

/** HP_APM_REGION13_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION13_ADDR_START_REG (DR_REG_HP_APM_BASE + 0xa0)
/** HP_APM_REGION13_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 13.
 */
#define HP_APM_REGION13_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION13_ADDR_START_M  (HP_APM_REGION13_ADDR_START_V << HP_APM_REGION13_ADDR_START_S)
#define HP_APM_REGION13_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION13_ADDR_START_S  0

/** HP_APM_REGION13_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION13_ADDR_END_REG (DR_REG_HP_APM_BASE + 0xa4)
/** HP_APM_REGION13_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 13.
 */
#define HP_APM_REGION13_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION13_ADDR_END_M  (HP_APM_REGION13_ADDR_END_V << HP_APM_REGION13_ADDR_END_S)
#define HP_APM_REGION13_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION13_ADDR_END_S  0

/** HP_APM_REGION13_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION13_ATTR_REG (DR_REG_HP_APM_BASE + 0xa8)
/** HP_APM_REGION13_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 13.
 */
#define HP_APM_REGION13_R0_X    (BIT(0))
#define HP_APM_REGION13_R0_X_M  (HP_APM_REGION13_R0_X_V << HP_APM_REGION13_R0_X_S)
#define HP_APM_REGION13_R0_X_V  0x00000001U
#define HP_APM_REGION13_R0_X_S  0
/** HP_APM_REGION13_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 13.
 */
#define HP_APM_REGION13_R0_W    (BIT(1))
#define HP_APM_REGION13_R0_W_M  (HP_APM_REGION13_R0_W_V << HP_APM_REGION13_R0_W_S)
#define HP_APM_REGION13_R0_W_V  0x00000001U
#define HP_APM_REGION13_R0_W_S  1
/** HP_APM_REGION13_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 13.
 */
#define HP_APM_REGION13_R0_R    (BIT(2))
#define HP_APM_REGION13_R0_R_M  (HP_APM_REGION13_R0_R_V << HP_APM_REGION13_R0_R_S)
#define HP_APM_REGION13_R0_R_V  0x00000001U
#define HP_APM_REGION13_R0_R_S  2
/** HP_APM_REGION13_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 13.
 */
#define HP_APM_REGION13_R1_X    (BIT(4))
#define HP_APM_REGION13_R1_X_M  (HP_APM_REGION13_R1_X_V << HP_APM_REGION13_R1_X_S)
#define HP_APM_REGION13_R1_X_V  0x00000001U
#define HP_APM_REGION13_R1_X_S  4
/** HP_APM_REGION13_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 13.
 */
#define HP_APM_REGION13_R1_W    (BIT(5))
#define HP_APM_REGION13_R1_W_M  (HP_APM_REGION13_R1_W_V << HP_APM_REGION13_R1_W_S)
#define HP_APM_REGION13_R1_W_V  0x00000001U
#define HP_APM_REGION13_R1_W_S  5
/** HP_APM_REGION13_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 13.
 */
#define HP_APM_REGION13_R1_R    (BIT(6))
#define HP_APM_REGION13_R1_R_M  (HP_APM_REGION13_R1_R_V << HP_APM_REGION13_R1_R_S)
#define HP_APM_REGION13_R1_R_V  0x00000001U
#define HP_APM_REGION13_R1_R_S  6
/** HP_APM_REGION13_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 13.
 */
#define HP_APM_REGION13_R2_X    (BIT(8))
#define HP_APM_REGION13_R2_X_M  (HP_APM_REGION13_R2_X_V << HP_APM_REGION13_R2_X_S)
#define HP_APM_REGION13_R2_X_V  0x00000001U
#define HP_APM_REGION13_R2_X_S  8
/** HP_APM_REGION13_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 13.
 */
#define HP_APM_REGION13_R2_W    (BIT(9))
#define HP_APM_REGION13_R2_W_M  (HP_APM_REGION13_R2_W_V << HP_APM_REGION13_R2_W_S)
#define HP_APM_REGION13_R2_W_V  0x00000001U
#define HP_APM_REGION13_R2_W_S  9
/** HP_APM_REGION13_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 13.
 */
#define HP_APM_REGION13_R2_R    (BIT(10))
#define HP_APM_REGION13_R2_R_M  (HP_APM_REGION13_R2_R_V << HP_APM_REGION13_R2_R_S)
#define HP_APM_REGION13_R2_R_V  0x00000001U
#define HP_APM_REGION13_R2_R_S  10
/** HP_APM_REGION13_LOCK : R/W; bitpos: [11]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_APM_REGION13_LOCK    (BIT(11))
#define HP_APM_REGION13_LOCK_M  (HP_APM_REGION13_LOCK_V << HP_APM_REGION13_LOCK_S)
#define HP_APM_REGION13_LOCK_V  0x00000001U
#define HP_APM_REGION13_LOCK_S  11

/** HP_APM_REGION14_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION14_ADDR_START_REG (DR_REG_HP_APM_BASE + 0xac)
/** HP_APM_REGION14_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 14.
 */
#define HP_APM_REGION14_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION14_ADDR_START_M  (HP_APM_REGION14_ADDR_START_V << HP_APM_REGION14_ADDR_START_S)
#define HP_APM_REGION14_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION14_ADDR_START_S  0

/** HP_APM_REGION14_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION14_ADDR_END_REG (DR_REG_HP_APM_BASE + 0xb0)
/** HP_APM_REGION14_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 14.
 */
#define HP_APM_REGION14_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION14_ADDR_END_M  (HP_APM_REGION14_ADDR_END_V << HP_APM_REGION14_ADDR_END_S)
#define HP_APM_REGION14_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION14_ADDR_END_S  0

